# 아래 그림과 같은 미로가 있다. 16*16 행렬의 형태로 만들어진 미로에서 흰색 바탕은 길, 노란색 바탕은 벽을 나타낸다.

# 가장 좌상단에 있는 칸을 (0, 0)의 기준으로 하여, 가로방향을 x 방향, 세로방향을 y 방향이라고 할 때, 미로의 시작점은 (1, 1)이고 도착점은 (13, 13)이다.

# 주어진 미로의 출발점으로부터 도착지점까지 갈 수 있는 길이 있는지 판단하는 프로그램을 작성하라.

# 아래의 예시에서는 도달 가능하다.

# [입력]

# 각 테스트 케이스의 첫 번째 줄에는 테스트 케이스의 번호가 주어지며, 바로 다음 줄에 테스트 케이스가 주어진다.

# 총 10개의 테스트케이스가 주어진다.

# 테스트 케이스에서 1은 벽을 나타내며 0은 길, 2는 출발점, 3은 도착점을 나타낸다.

# [출력]

#부호와 함께 테스트 케이스의 번호를 출력하고, 공백 문자 후 도달 가능 여부를 1 또는 0으로 표시한다 (1 - 가능함, 0 - 가능하지 않음).

# 1
# 1111111111111111
# 1210000000100011
# 1010101110101111
# 1000100010100011
# 1111111010101011
# 1000000010101011
# 1011111110111011
# 1010000010001011
# 1010101111101011
# 1010100010001011
# 1010111010111011
# 1010001000100011
# 1011101111101011
# 1000100000001311
# 1111111111111111
# 1111111111111111

#1 1
from collections import deque

T = int(input())

for test_case in range(1, 11):
    dr = [-1, 1, 0, 0]
    dc = [0, 0, -1, 1]
    room = []

    for _ in range(16):
        row = list(map(int, input()))
        room.append(row)

    sr = sc = 0
    for r in range(16):
        for c in range(16):
            if room[r][c] == 2:
                sr, sc = r, c

    q = deque()

    visited = [[0]*16 for _ in range(16)]
    visited[sr][sc] = 1
    q.append((sr, sc))

    ans = 0

    while q:
        r, c = q.popleft()

        if room[r][c] == 3:
            ans = 1
            break
        
        for i in range(4):
            nr = r + dr[i]
            nc = c + dc[i]

            if 0 <= nr < 16 and 0 <= nc < 16:
                if not visited[nr][nc] and room[nr][nc] != 1:
                    visited[nr][nc] = 1
                    q.append((nr, nc))

    print(f"#{test_case} {ans}")

